import React, { useEffect } from 'react';
import styled from 'styled-components'

const Container = styled.div`
`

const Body = styled.div`
    over-flow:scroll;
    // margin-top:3rem;
    padding:1rem;
`
const Title = styled.span`
    font-weight:bold
`
const PopcyTH = () => {
    useEffect(() => {
        document.title = "popcy | GOOChat"
    }, [])
    return (
        <Container>
            <Body>
                <h1><Title>GooChat นโยบายความเป็นส่วนตัว</Title></h1>

                <h3><Title>1.บทนำ</Title></h3>

                <p>นโยบายความเป็นส่วนตัวนี้กำหนดวิธีที่เรา GooChat SDN BHD. (&ldquo;GooChat&rdquo;) ใช้และปกป้องข้อมูลส่วนบุคคลของคุณที่คุณมอบให้เรา หรือที่เราได้รับหรือสร้างขึ้นโดยประการอื่น ที่เกี่ยวข้องกับการใช้บริการส่งข้อความบนคลาวด์ของเรา (&ldquo;บริการ&rdquo;) สำหรับวัตถุประสงค์ของนโยบายความเป็นส่วนตัวนี้ 'เรา', 'พวกเรา' และ 'ของเรา' หมายถึง GooChat และ 'คุณ' หมายถึงคุณ ผู้ใช้บริการ</p>
                <h4><Title>1.1 หลักการความเป็นส่วนตัว</Title></h4>
                <p>GooChat มีหลักการพื้นฐานสองประการในการรวบรวมและประมวลผลข้อมูลส่วนตัว:</p>
                <p>เราไม่ใช้ข้อมูลของคุณเพื่อแสดงโฆษณา</p>
                <p>เราจัดเก็บข้อมูลที่ GooChat จำเป็นต้องใช้เพื่อทำหน้าที่เป็นบริการส่งข้อความที่ปลอดภัยและมีคุณลักษณะมากมายเท่านั้น</p>
                <h4><Title>1.2. เงื่อนไขการให้บริการ</Title></h4>
                <p>นโยบายความเป็นส่วนตัวนี้เป็นส่วนหนึ่งของเงื่อนไขการบริการของเรา ซึ่งอธิบายเงื่อนไขที่คุณใช้บริการของเราและมีอยู่ที่ https://app.goochat.net/term/th นโยบายความเป็นส่วนตัวนี้จึงควรอ่านร่วมกับสิ่งเหล่านั้น เงื่อนไข</p>
                <h4><Title>1.3. สารบัญ</Title></h4>
                <p>นโยบายความเป็นส่วนตัวนี้อธิบายสิ่งต่อไปนี้:</p>
                <p>พื้นฐานทางกฎหมายสำหรับการประมวลผลข้อมูลส่วนบุคคลของคุณ</p>
                <p>ข้อมูลส่วนบุคคลใดที่เราอาจรวบรวมจากคุณ</p>
                <p>เรารักษาข้อมูลส่วนบุคคลของคุณให้ปลอดภัยได้อย่างไร</p>
                <p>เราอาจใช้ข้อมูลส่วนบุคคลของคุณเพื่ออะไร</p>
                <p>ข้อมูลส่วนบุคคลของคุณอาจถูกแบ่งปันด้วย</p>
                <p>สิทธิ์ของคุณเกี่ยวกับข้อมูลส่วนบุคคลของคุณ</p>

                <h3><Title>2.เหตุผลทางกฎหมายสำหรับการประมวลผลข้อมูลส่วนบุคคลของคุณ</Title></h3>

                <p>เราประมวลผลข้อมูลส่วนบุคคลของคุณโดยอ้างว่าการประมวลผลดังกล่าวมีความจำเป็นต่อผลประโยชน์ที่ชอบด้วยกฎหมายของเรา (รวมถึง: (1) การให้บริการที่มีประสิทธิภาพและเป็นนวัตกรรมใหม่แก่ผู้ใช้ของเรา และ (2) เพื่อตรวจจับ ป้องกัน หรือจัดการกับปัญหาการฉ้อโกงหรือความปลอดภัย ของข้อกำหนดในการให้บริการของเรา) เว้นแต่ผลประโยชน์เหล่านั้นจะถูกแทนที่ด้วยผลประโยชน์ของคุณหรือสิทธิและเสรีภาพขั้นพื้นฐานที่ต้องการการปกป้องข้อมูลส่วนบุคคล</p>

                <h3><Title> 3.ข้อมูลส่วนบุคคลใดที่เราใช้</Title></h3>

                <h4><Title>3.1. ข้อมูลบัญชีพื้นฐาน</Title></h4>
                <p>GooChat เป็นบริการสื่อสาร คุณระบุหมายเลขโทรศัพท์มือถือและข้อมูลบัญชีพื้นฐาน (ซึ่งอาจรวมถึงชื่อโปรไฟล์ รูปโปรไฟล์ และข้อมูลเกี่ยวข้อง) เพื่อสร้างบัญชี GooChat เพื่อให้ผู้ติดต่อและคนอื่น ๆ ของคุณเข้าถึงคุณได้ง่ายขึ้นและรู้ว่าคุณเป็นใคร ชื่อหน้าจอที่คุณเลือก รูปโปรไฟล์ และชื่อผู้ใช้ของคุณ (คุณควรเลือกที่จะตั้งค่า) บน GooChat จะเป็นแบบสาธารณะเสมอ เราไม่ต้องการทราบชื่อจริง เพศ อายุ หรือสิ่งที่คุณชอบ เราไม่ต้องการชื่อหน้าจอของคุณให้เป็นชื่อจริงของคุณ โปรดทราบว่าผู้ใช้ที่มีคุณในรายชื่อติดต่อจะเห็นคุณตามชื่อที่บันทึกไว้ ไม่ใช่ชื่อหน้าจอของคุณ ด้วยวิธีนี้ แม่ของคุณสามารถมีชื่อสาธารณะว่า 'Johnny Depp' ในขณะที่แสดงเป็น 'แม่' กับคุณและเป็น 'เจ้านาย' ต่อลูกน้องของเธอในที่ทำงาน (หรือในทางกลับกัน ขึ้นอยู่กับว่าความสัมพันธ์เหล่านี้มีโครงสร้างอย่างไร)</p>
                <h4><Title>3.2. ที่อยู่อีเมลของคุณ</Title></h4>
                <p>เมื่อคุณเปิดใช้งานการลงชื่อเข้าใช้อีเมล คุณสามารถเลือกตั้งค่าอีเมลกู้คืนรหัสผ่านได้ ที่อยู่นี้จะใช้เพื่อส่งรหัสกู้คืนรหัสผ่านหากคุณลืม ถูกต้อง: ไม่มีการตลาดหรือเรื่องไร้สาระ "พวกเราคิดถึงคุณ"</p>
                <h4><Title>3.3. ข้อความของคุณ</Title></h4>
                <h5><Title>3.3.1. แชทบนคลาวด์</Title></h5>
                <p>GooChat เป็นบริการคลาวด์ เราจัดเก็บข้อความ รูปภาพ วิดีโอ และเอกสารจากการแชทบนคลาวด์ของคุณบนเซิร์ฟเวอร์ของเรา เพื่อให้คุณสามารถเข้าถึงข้อมูลของคุณจากอุปกรณ์ใดก็ได้</p>
                <h5><Title>3.3.2. แชทสาธารณะ</Title></h5>
                <p>นอกจากข้อความส่วนตัวแล้ว GooChat ยังรองรับช่องสาธารณะและกลุ่มสาธารณะอีกด้วย การแชทสาธารณะทั้งหมดเป็นการแชทบนคลาวด์ (ดูหัวข้อ 3.3.1 ด้านบน) เช่นเดียวกับทุกอย่างบน GooChat ข้อมูลที่คุณโพสต์ในชุมชนสาธารณะจะถูกเข้ารหัส ทั้งในที่จัดเก็บและระหว่างทาง แต่ทุกสิ่งที่คุณโพสต์ในที่สาธารณะจะเข้าถึงได้สำหรับทุกคน</p>
                <h4><Title>3.4. หมายเลขโทรศัพท์และผู้ติดต่อ</Title></h4>
                <p>หมายเลขโทรศัพท์และผู้ติดต่อ GooChat ใช้หมายเลขโทรศัพท์เป็นตัวระบุที่ไม่ซ้ำกัน เพื่อให้คุณเปลี่ยนจาก SMS และแอปส่งข้อความอื่น ๆ และเก็บกราฟโซเชียลของคุณได้อย่างง่ายดาย เราขออนุญาตจากคุณก่อนที่จะซิงค์รายชื่อของคุณ เราจัดเก็บผู้ติดต่อที่เป็นปัจจุบันของคุณเพื่อแจ้งให้คุณทราบทันทีที่ผู้ติดต่อรายใดรายหนึ่งของคุณสมัครใช้งาน GooChat และแสดงชื่อในการแจ้งเตือนอย่างเหมาะสม เราต้องการเพียงหมายเลขและชื่อ (ชื่อและนามสกุล) เพื่อให้ใช้งานได้และไม่มีการจัดเก็บข้อมูลอื่น ๆ เกี่ยวกับผู้ติดต่อของคุณ&nbsp;</p>
                <p>อัลกอริธึมอัตโนมัติของเรายังสามารถใช้ชุดหมายเลขโทรศัพท์ที่ไม่ระบุชื่อเพื่อคำนวณจำนวนโดยประมาณของผู้ติดต่อที่เป็นไปได้ที่หมายเลขโทรศัพท์ที่ไม่ได้ลงทะเบียนอาจมีใน GooChat เมื่อคุณเปิดอินเทอร์เฟซ 'เชิญเพื่อน' เราจะแสดงสถิติผลลัพธ์ถัดจากผู้ติดต่อของคุณ เพื่อให้คุณได้แนวคิดว่าใครจะได้ประโยชน์มากที่สุดจากการเข้าร่วม GooChat คุณสามารถหยุดการซิงค์ผู้ติดต่อหรือลบออกจากเซิร์ฟเวอร์ของเราในการตั้งค่า &gt; ติดต่อ</p>
                <h4><Title>3.5. ข้อมูลตำแหน่ง</Title></h4>
                <p>ข้อมูลตำแหน่งนี้ได้รับการปฏิบัติเหมือนข้อความอื่นๆ หากคุณระบุตำแหน่งของคุณในโปรไฟล์บัญชีทางการ GooChat จะใช้ข้อมูลของคุณเพื่อแสดงตำแหน่งของคุณต่อผู้ใช้ที่คุณแบ่งปันด้วย แม้ว่าแอพจะปิด ตราบใดที่คุณเปิดใช้งานคุณสมบัติเสริมเหล่านี้</p>

                <h3><Title> 4.การรักษาข้อมูลส่วนบุคคลของคุณให้ปลอดภัย</Title></h3>

                <h4><Title>4.1. การจัดเก็บข้อมูล</Title></h4>
                <p>ข้อมูลของคุณถูกเก็บไว้ในศูนย์ข้อมูล เหล่านี้เป็นศูนย์ข้อมูลของบุคคลที่สามที่ GooChat เช่าพื้นที่ที่กำหนด อย่างไรก็ตาม เซิร์ฟเวอร์และเครือข่ายที่อยู่ภายในศูนย์ข้อมูลเหล่านี้และที่เก็บข้อมูลส่วนบุคคลของคุณนั้นเป็นของ GooChat ด้วยเหตุนี้ เราไม่แบ่งปันข้อมูลส่วนบุคคลของคุณกับศูนย์ข้อมูลดังกล่าว ข้อมูลทั้งหมดได้รับการเข้ารหัสอย่างแน่นหนาเพื่อให้วิศวกร Goochat ในพื้นที่หรือผู้บุกรุกทางกายภาพไม่สามารถเข้าถึงได้</p>
                <h4><Title>4.2.การเก็บรักษา</Title></h4>
                <p>เว้นแต่จะระบุไว้เป็นอย่างอื่นในนโยบายความเป็นส่วนตัวนี้ ข้อมูลส่วนบุคคลที่คุณให้เราจะถูกเก็บไว้ตราบเท่าที่จำเป็นสำหรับเราที่จะปฏิบัติตามภาระผูกพันของเราในส่วนที่เกี่ยวกับการให้บริการ</p>

                <h3><Title> 5.การประมวลผลข้อมูลส่วนบุคคลของคุณ</Title></h3>

                <h4><Title>5.1. บริการของเรา</Title></h4>
                <p>GooChat เป็นบริการคลาวด์ เราจะประมวลผลข้อมูลของคุณเพื่อส่งประวัติการแชทบนคลาวด์ของคุณ รวมถึงข้อความ สื่อ และไฟล์ ไปยังอุปกรณ์ใดๆ ที่คุณเลือก</p>
                <h4><Title>5.2. ความปลอดภัยและความมั่นคง</Title></h4>
                <p>GooChat สนับสนุนชุมชนขนาดใหญ่ที่เราต้องตรวจสอบการละเมิดและการละเมิดข้อกำหนดในการให้บริการ GooChat มีผู้ใช้จำนวนมาก ทำให้เป็นเป้าหมายที่ร่ำรวยสำหรับผู้ส่งอีเมลขยะ เพื่อปรับปรุงความปลอดภัยของบัญชีของคุณ เช่นเดียวกับการป้องกันสแปม การละเมิด และการละเมิดข้อกำหนดในการให้บริการอื่นๆ ของเรา เราอาจรวบรวมข้อมูลเมตา เช่น ที่อยู่ IP ของคุณ อุปกรณ์และแอป GooChat ที่คุณใช้ ประวัติการเปลี่ยนชื่อผู้ใช้ ฯลฯ หาก รวบรวม ดวงตานี้ถูกเก็บไว้สูงสุด 12 เดือน</p>

                <h4><Title>5.3. สแปมและการละเมิด</Title></h4>
                <p>เพื่อป้องกันฟิชชิง สแปม และการละเมิดประเภทอื่นๆ และสำหรับการละเมิดข้อกำหนดในการให้บริการของ GooChat ผู้ดูแลของเราอาจตรวจสอบข้อความที่ผู้รับรายงานถึงพวกเขา หากรายงานสแปมเกี่ยวกับข้อความที่คุณส่งได้รับการยืนยันโดยผู้ดูแลของเรา บัญชีของคุณอาจถูกจำกัดไม่ให้ติดต่อกับคนแปลกหน้า - ชั่วคราวหรือถาวร คุณสามารถส่งคำขอโดยใช้ฟังก์ชันรายงานสำหรับผู้ติดต่อและข้อความ ในกรณีที่มีการละเมิดร้ายแรง บัญชีของคุณอาจถูกแบน เราอาจใช้อัลกอริทึมอัตโนมัติเพื่อวิเคราะห์ข้อความในการแชทบนคลาวด์เพื่อหยุดสแปมและฟิชชิง</p>
                <h4><Title>5.4. การทำงานข้ามอุปกรณ์</Title></h4>
                <p>เราอาจจัดเก็บข้อมูลแบบรวมบางส่วนเพื่อสร้างฟีเจอร์ GooChat ที่ทำงานบนอุปกรณ์ทั้งหมดของคุณ</p>
                <h4><Title>5.5. ไม่มีโฆษณาตามข้อมูลผู้ใช้</Title></h4>
                <p>ไม่เหมือนกับบริการอื่นๆ เราไม่ใช้ข้อมูลของคุณเพื่อกำหนดเป้าหมายโฆษณาหรือเพื่อวัตถุประสงค์ทางการค้าอื่นๆ GooChat จัดเก็บเฉพาะข้อมูลที่จำเป็นสำหรับการทำงานเป็นบริการคลาวด์ที่ปลอดภัยและเต็มไปด้วยคุณสมบัติ&nbsp;</p>
                <p>GooChat เสนอเครื่องมือสำหรับผู้โฆษณาเพื่อโปรโมตข้อความของพวกเขาในช่องทางสาธารณะแบบหนึ่งต่อหลายช่อง แต่ข้อความที่ได้รับการสนับสนุนเหล่านี้อิงตามหัวข้อของช่องสาธารณะที่แสดงเท่านั้น ไม่มีการขุดหรือวิเคราะห์ข้อมูลผู้ใช้เพื่อแสดงโฆษณาหรือข้อความที่ได้รับการสนับสนุน</p>

                <h3><Title> 6.ข้อมูลส่วนบุคคลของคุณอาจถูกแบ่งปันกับใคร</Title></h3>

                <h4><Title>6.1. ผู้ใช้ GooChat คนอื่นๆ</Title></h4>
                <p>ผู้ใช้บริการรายอื่นของเราซึ่งคุณเลือกที่จะสื่อสารด้วยและแบ่งปันข้อมูลบางอย่างซึ่งอาจอยู่ภายนอก โปรดทราบว่าการเข้าสู่ข้อกำหนดในการให้บริการและเลือกสื่อสารกับผู้ใช้ GooChat คนอื่นๆ แสดงว่าคุณกำลังแนะนำให้เราถ่ายโอนข้อมูลส่วนบุคคลของคุณในนามของคุณไปยังผู้ใช้เหล่านั้นตามนโยบายความเป็นส่วนตัวนี้ เราใช้มาตรการทางเทคนิคและองค์กรที่เหมาะสมทั้งหมด (รวมถึงการเข้ารหัสข้อมูลส่วนบุคคลของคุณ) เพื่อให้แน่ใจว่าระดับการรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคลของคุณที่เหมาะสมกับความเสี่ยง</p>

                <h3><Title> 7.สิทธิ์ของคุณเกี่ยวกับข้อมูลส่วนบุคคลที่คุณให้กับเรา</Title></h3>

                <h4><Title>7.1. สิทธิของคุณ</Title></h4>
                <p>ภายใต้กฎหมายคุ้มครองข้อมูลที่บังคับใช้ ในบางกรณี คุณมีสิทธิ์เกี่ยวกับข้อมูลส่วนบุคคลของคุณ คุณมีสิทธิ์ที่จะ: (1) ขอสำเนาข้อมูลส่วนบุคคลทั้งหมดของคุณที่เราจัดเก็บและส่งสำเนานั้นไปยังผู้ควบคุมข้อมูลรายอื่น (2) ลบ (ดูหัวข้อ 8 ด้านล่าง) หรือแก้ไขข้อมูลส่วนบุคคลของคุณ (3) จำกัดหรือคัดค้านการประมวลผลข้อมูลส่วนบุคคลของคุณ (4) แก้ไขข้อมูลส่วนบุคคลที่ไม่ถูกต้องหรือไม่สมบูรณ์ที่เราเก็บไว้กับคุณ และ (5) ยื่นคำร้องต่อหน่วยงานคุ้มครองข้อมูลของประเทศเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลของคุณ</p>
                <h4><Title>7.2. การใช้สิทธิของคุณ</Title></h4>
                <p>หากคุณต้องการใช้สิทธิ์ใดๆ เหล่านี้ โปรดติดต่อเราโดยใช้รายละเอียดในส่วนที่ 10 ด้านล่าง</p>
                <h4><Title>7.3. การตั้งค่าข้อมูล</Title></h4>
                <p>คุณสามารถควบคุมวิธีการใช้ข้อมูลของคุณ (เช่น ลบผู้ติดต่อที่ซิงค์) ในการตั้งค่า &gt; ผู้ติดต่อ (โดยใช้หนึ่งในแอพมือถือของเรา)</p>
                <p>น่าเศร้า หากคุณไม่เห็นด้วยกับข้อกำหนดขั้นต่ำของ GooChat เราไม่สามารถให้บริการแก่คุณได้ คุณสามารถลบบัญชี GooChat ได้โดยไปที่การตั้งค่า &gt; บัญชี</p>

                <h3><Title> 8.การลบข้อมูล</Title></h3>

                <h4><Title>8.1. บัญชี</Title></h4>
                <p>หากคุณต้องการลบบัญชีของคุณ คุณสามารถทำได้ในการตั้งค่า &gt; บัญชี การลบบัญชีของคุณจะลบข้อความ สื่อ รายชื่อติดต่อ และข้อมูลอื่นๆ ทั้งหมดที่คุณจัดเก็บไว้ใน GooChat cloud การดำเนินการนี้ต้องได้รับการยืนยันผ่านบัญชี GooChat ของคุณและไม่สามารถยกเลิกได้</p>
                <h4><Title>8.2. ข้อความ</Title></h4>
                <p>ในการแชทบนคลาวด์ คุณสามารถเลือกที่จะลบข้อความสำหรับผู้เข้าร่วมทั้งหมดอย่างน้อย 24 ชั่วโมงหลังจากส่ง มิฉะนั้น การลบข้อความจะเป็นการลบออกจากประวัติข้อความของคุณ ซึ่งหมายความว่าสำเนาจะอยู่บนเซิร์ฟเวอร์ซึ่งเป็นส่วนหนึ่งของประวัติข้อความของคู่ของคุณ ทันทีที่คู่ของคุณลบออก ข้อมูลก็จะสูญหายไปตลอดกาลเช่นกัน ในเวอร์ชันนี้ ฝ่ายใดฝ่ายหนึ่งสามารถเลือกล้างประวัติการแชททั้งหมดสำหรับทั้งสองฝ่ายได้ ในกรณีนี้ แอพจะได้รับคำสั่งให้ลบข้อความทั้งหมดในแชทนั้น ไม่ว่าผู้เข้าร่วมหนึ่งคนจะเก็บข้อความไว้กี่ข้อความ ในกลุ่ม การลบข้อความจะลบข้อความสำหรับผู้เข้าร่วมทั้งหมด</p>
                <h4><Title>8.3. ข้อความทำลายตนเอง</Title></h4>
                <p>ข้อความสามารถทำลายตัวเองได้ จะเริ่มนับถอยหลังจากขั้นตอนการส่งข้อความเสร็จสมบูรณ์ และเมื่อเวลานับถอยหลังหมด แอพจะได้รับคำสั่งให้ลบข้อความทั้งแบบส่วนตัวหรือแบบกลุ่ม</p>

                <h3><Title> 9.การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้</Title></h3>

                <p>เราจะตรวจสอบและอาจอัปเดตนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้จะมีผลเมื่อเราโพสต์นโยบายความเป็นส่วนตัวฉบับแก้ไขในหน้านี้ https://app.goochat.net/popcy/en โปรดตรวจสอบเว็บไซต์ของเราบ่อยๆ เพื่อดูการอัปเดตหรือการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวของเรา ซึ่งเราจะอธิบายสั้น ๆ ด้านล่าง</p>
                <p>เอกสารนี้ได้รับการปรับปรุงล่าสุดเมื่อวันที่ 5 เมษายน 2022</p>
                <p>การเปลี่ยนแปลงที่สำคัญในนโยบายความเป็นส่วนตัวนี้จะได้รับแจ้งให้คุณทราบผ่าน GooChat</p>

                <h3><Title> 10.คำถามและข้อกังวล</Title></h3>

                <p>หากคุณมีคำถามเกี่ยวกับความเป็นส่วนตัวและนโยบายข้อมูลของเรา โปรดติดต่อ Goochat ID: goochatofficial หรือ E-mail: goochat-admin@goochat.chat ซึ่งเราจะตอบโดยเร็วที่สุด</p>
            </Body>
        </Container>
    )
}
export default PopcyTH;