import React,{ useEffect } from 'react';
import styled from 'styled-components'

const Container = styled.div`
`
const Body = styled.div`
    over-flow:scroll;
    // margin-top:3rem;
    padding:1rem;
`
const Title = styled.p`
    font-weight:bold
`
const Termth = () => {
    useEffect(() => {
        document.title = "term and condition | GOOChat"
    }, [])
    return (
        <Container>
            <Body>
                <p>GOOChat ข้อกำหนดและเงื่อนไขการใช้งานเหล่านี้ (“ ข้อกำหนดและเงื่อนไข” เหล่านี้) กำหนดข้อกำหนดและเงื่อนไขสำหรับการใช้ผลิตภัณฑ์และบริการใด ๆ และทั้งหมด (เรียกรวมกันว่า“ บริการ”) ที่ GOOChat ให้กับผู้ใช้บริการ (“ ผู้ใช้” หรือ“ ผู้ใช้” ขึ้นอยู่กับบริบท)</p>

                <Title>1.คำจำกัดความ</Title>

                <p>คำและข้อกำหนดต่อไปนี้จะมีความหมายตามที่กำหนดไว้ด้านล่างเมื่อใช้ในข้อกำหนดและเงื่อนไขเหล่านี้ 
                <br/>1.1. “เนื้อหา” หมายถึงข้อมูลเช่นข้อความเสียงเพลงรูปภาพวิดีโอซอฟต์แวร์โปรแกรมรหัสคอมพิวเตอร์และข้อมูลอื่น ๆ 
                <br/>1.2. “เนื้อหาของเรื่อง” หมายถึงเนื้อหาที่อาจเข้าถึงได้ผ่านบริการ 
                <br/>1.3. “เนื้อหาที่ส่งมา” หมายถึงเนื้อหาที่ผู้ใช้ส่งหรืออัปโหลดไปยังบริการ 
                <br/>1.4. “ข้อกำหนดและเงื่อนไขแยกต่างหาก” หมายถึงข้อกำหนดและเงื่อนไขที่แยกจากข้อกำหนดและเงื่อนไขเหล่านี้ซึ่งเกี่ยวข้องกับบริการที่ปล่อยหรืออัปโหลดโดย GOOChat ภายใต้ชื่อเช่น” ข้อกำหนด”“ แนวทางปฏิบัติ”“ นโยบาย” หรืออื่น ๆ ที่คล้ายกัน</p>

                <Title>2. การยอมรับข้อกำหนดและเงื่อนไขเหล่านี้</Title>

                <p>2.1 ผู้ใช้ทุกคนจะต้องใช้บริการตามข้อกำหนดและเงื่อนไขเหล่านี้ ผู้ใช้ไม่สามารถใช้บริการได้เว้นแต่จะยอมรับข้อกำหนดและเงื่อนไขเหล่านี้ 
                <br/>2.2 ผู้ใช้ที่เป็นผู้เยาว์สามารถใช้บริการได้โดยได้รับความยินยอมล่วงหน้าจากพ่อแม่หรือผู้ปกครองตามกฎหมายเท่านั้น นอกจากนี้หากผู้ใช้จะใช้บริการในนามของหรือเพื่อวัตถุประสงค์ขององค์กรธุรกิจองค์กรธุรกิจดังกล่าวจะต้องยอมรับข้อกำหนดและเงื่อนไขเหล่านี้ก่อนที่จะใช้บริการ 
                <br/>2.3 หากมีข้อกำหนดและเงื่อนไขแยกต่างหากที่บังคับใช้กับบริการผู้ใช้จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขแยกต่างหากเช่นเดียวกับข้อกำหนดและเงื่อนไขเหล่านี้ในการใช้บริการ</p>

                <Title>3. การแก้ไขข้อกำหนดและเงื่อนไขเหล่านี้</Title>

                <p>GOOChat อาจแก้ไขข้อกำหนดและเงื่อนไขเหล่านี้เมื่อ GOOChat เห็นว่าจำเป็นภายในขอบเขตของวัตถุประสงค์ของบริการ ในกรณีเช่นนี้ GOOChat จะระบุเนื้อหาของข้อกำหนดและเงื่อนไขฉบับแก้ไขตลอดจนวันที่มีผลบังคับใช้ของการแก้ไขบนบริการหรือบนเว็บไซต์ของ GOOChat หรือจะเผยแพร่สิ่งเดียวกันนี้ให้ผู้ใช้ทราบโดยแจ้งให้ผู้ใช้ทราบในลักษณะ กำหนดโดย GOOChat ข้อกำหนดและเงื่อนไขฉบับแก้ไขจะมีผลบังคับใช้ ณ วันที่มีผลบังคับใช้</p>

                <Title>4. บัญชี</Title>

                <p>4.1 เมื่อใช้บริการผู้ใช้อาจต้องตั้งค่าบัญชีโดยการลงทะเบียนข้อมูลบางอย่าง ผู้ใช้จะต้องลงทะเบียนข้อมูลที่เป็นจริงถูกต้องและครบถ้วนและต้องแก้ไขข้อมูลเดิมเพื่อให้ข้อมูลดังกล่าวเป็นปัจจุบันตลอดเวลา 
                <br/>4.2 หากผู้ใช้ลงทะเบียนข้อมูลการรับรองความถูกต้องใด ๆ เมื่อใช้บริการพวกเขาจะต้องใช้ความระมัดระวังในการจัดการข้อมูลดังกล่าวด้วยความรับผิดชอบของตนเองเพื่อให้แน่ใจว่าข้อมูลดังกล่าวจะไม่ถูกนำไปใช้ในลักษณะที่ผิดกฎหมาย GOOChat อาจถือว่ากิจกรรมใด ๆ และทั้งหมดที่ดำเนินการภายใต้ข้อมูลการรับรองความถูกต้องเป็นกิจกรรมที่ดำเนินการโดยผู้ใช้ที่ลงทะเบียนข้อมูลการรับรองความถูกต้อง 
                <br/>4.3 ผู้ใช้ใด ๆ ที่ลงทะเบียนสำหรับบริการอาจลบบัญชีของผู้ใช้ดังกล่าวและยกเลิกบริการได้ตลอดเวลา 
                <br/>4.4 สิทธิ์ใด ๆ และทั้งหมดของผู้ใช้ในการใช้บริการจะสิ้นสุดลงเมื่อบัญชีของผู้ใช้ดังกล่าวถูกลบไม่ว่าด้วยเหตุผลใดก็ตาม โปรดทราบว่าไม่สามารถเรียกคืนบัญชีได้แม้ว่าผู้ใช้จะลบบัญชีโดยไม่ได้ตั้งใจก็ตาม 
                <br/>4.5 แต่ละบัญชีในบริการมีไว้สำหรับการใช้งานโดยเฉพาะและเป็นของผู้ใช้บัญชีดังกล่าว แต่เพียงผู้เดียว ผู้ใช้ไม่สามารถถ่ายโอนเช่าหรือจำหน่ายสิทธิ์ในการใช้บริการให้กับบุคคลที่สามใด ๆ และไม่สามารถรับมรดกหรือสืบทอดต่อจากบุคคลที่สามได้</p>

                <Title>5. ความเป็นส่วนตัว</Title>

                <p>5.1.GOOChat ให้ความสำคัญสูงสุดกับความเป็นส่วนตัวของผู้ใช้ 
                <br/>5.2 GOOChat จะจัดการข้อมูลความเป็นส่วนตัวและข้อมูลส่วนบุคคลของผู้ใช้อย่างเหมาะสมตามนโยบายความเป็นส่วนตัวของ GOOChat 
                <br/>5.3 GOOChat สัญญาว่าจะใช้ความระมัดระวังสูงสุดและใส่ใจต่อมาตรการรักษาความปลอดภัยเพื่อให้แน่ใจว่ามีการจัดการข้อมูลใด ๆ และทั้งหมดที่รวบรวมจากผู้ใช้อย่างปลอดภัย</p>

                <Title>6. ข้อกำหนดของบริการ</Title>

                <p>6.1 ผู้ใช้จะต้องจัดหาอุปกรณ์โทรศัพท์มือถือสมาร์ทโฟนและอุปกรณ์สื่อสารอื่น ๆ ระบบปฏิบัติการวิธีการสื่อสารและไฟฟ้า ฯลฯ ที่จำเป็นสำหรับการใช้บริการด้วยความรับผิดชอบและเป็นค่าใช้จ่ายของตนเอง 
                <br/>6.2 GOOChat ขอสงวนสิทธิ์ในการ จำกัด การเข้าถึงบริการทั้งหมดหรือบางส่วนของผู้ใช้ทั้งนี้ขึ้นอยู่กับเงื่อนไขที่ GOOChat เห็นว่าจำเป็นเช่นอายุและการระบุตัวผู้ใช้สถานะการลงทะเบียนปัจจุบันและอื่น ๆ ที่คล้ายกัน 
                <br/>6.3 GOOChat ขอสงวนสิทธิ์ในการแก้ไขตามดุลยพินิจของ GOOChat บริการทั้งหมดหรือบางส่วนตามที่ GOOChat กำหนดว่าจำเป็นเมื่อใดก็ได้โดยไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า 
                <br/>6.4 GOOChat อาจยุติการให้บริการทั้งหมดหรือบางส่วนโดยไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้าในกรณีที่เกิดเหตุการณ์ดังต่อไปนี้: 
                <br/>(1) เมื่อดำเนินการบำรุงรักษาหรือซ่อมแซมระบบ 
                <br/>(2) เมื่อไม่สามารถให้บริการได้เนื่องจากเหตุสุดวิสัยเช่นอุบัติเหตุ (ไฟไหม้ไฟดับ ฯลฯ ) การกระทำของพระเจ้าสงครามการจลาจลข้อพิพาทแรงงาน 
                <br/>(3) เมื่อระบบขัดข้องหรือมีภาระงานหนักในระบบ 
                <br/>(4) เมื่อรักษาความปลอดภัยของผู้ใช้หรือบุคคลที่สามหรือในกรณีฉุกเฉินเพื่อสวัสดิการสาธารณะ หรือ 
                <br/>(5) เมื่อ GOOChat พิจารณาอย่างสมเหตุสมผลว่าจำเป็นนอกเหนือจากที่ระบุไว้ในข้อ (1) ถึง (4)</p>

                <Title>7. ไม่มีฟังก์ชั่นการโทรฉุกเฉิน</Title>

                <p>บริการนี้ไม่สามารถพึ่งพาสำหรับการโทรฉุกเฉินเช่นบริการที่ทำกับหน่วยงานบังคับใช้กฎหมายหน่วยงานด้านความปลอดภัยทางทะเลหน่วยดับเพลิงหรือบริการฉุกเฉินอื่น ๆ</p>

                <Title>8. เนื้อหา</Title>

                <p>8.1 GOOChat ให้สิทธิ์แก่ผู้ใช้ที่ไม่สามารถโอนถ่ายโอนไม่ได้ไม่อนุญาตให้ใช้งานไม่ได้และไม่ผูกขาดในการใช้เนื้อหาหัวเรื่องที่จัดเตรียมโดย GOOChat เพียงเพื่อวัตถุประสงค์ในการใช้บริการ 
                    <br/>8.2 ผู้ใช้จะต้องปฏิบัติตามเงื่อนไขที่บังคับใช้เมื่อใช้เนื้อหาเรื่องซึ่งอยู่ภายใต้เงื่อนไขการใช้งานเช่นค่าธรรมเนียมเพิ่มเติมและระยะเวลาการใช้งานและอื่น ๆ ที่คล้ายกัน แม้ว่าคำเช่น “การซื้อ” “การขาย” และสิ่งที่คล้ายกันจะปรากฏบนหน้าจอของบริการ GOOChat จะยังคงเป็นเจ้าของสิทธิ์ในทรัพย์สินทางปัญญาทั้งหมดตลอดจนสิทธิ์อื่น ๆ ทั้งหมดในเนื้อหาเรื่องที่ GOOChat เสนอให้กับผู้ใช้ และสิทธิ์ดังกล่าวจะไม่ถูกโอนไปยังผู้ใช้ ผู้ใช้จะได้รับสิทธิ์การใช้งานตามที่ระบุไว้ข้างต้นเท่านั้น 
                    <br/>8.3 ผู้ใช้จะต้องไม่ใช้เนื้อหาของหัวเรื่องเกินขอบเขตของการใช้งานเนื้อหาที่ต้องการในบริการ (รวมถึง แต่ไม่ จำกัด เพียงการคัดลอกการส่งการทำซ้ำและการแก้ไข) 
                    <br/>8.4 หากผู้ใช้ต้องการสำรองข้อมูลทั้งหมดหรือบางส่วนของเนื้อหาที่ส่งมาพวกเขาจะต้องดำเนินการด้วยตนเอง GOOChat จะไม่รับผิดชอบในการสำรองเนื้อหาใด ๆ ที่ส่งมา 
                    <br/>8.5 บริการอาจรวมถึงฟังก์ชันที่ผู้ใช้หลายคนสามารถแก้ไขเนื้อหาได้ (โพสต์แก้ไขและลบ ฯลฯ) ในกรณีเช่นนี้ผู้ใช้ที่โพสต์เนื้อหาที่ส่งมาจะให้สิทธิ์แก่ผู้ใช้รายอื่นในการแก้ไขเนื้อหาที่ส่งดังกล่าว 
                    <br/>8.6 ผู้ใช้จะรักษาสิทธิ์ในเนื้อหาที่ส่งมาและ GOOChat จะไม่ได้รับสิทธิ์ดังกล่าว อย่างไรก็ตามในบรรดาเนื้อหาที่ส่งมาสำหรับเนื้อหาที่ให้บริการแก่ผู้ใช้รายอื่นโดยทั่วไป (กล่าวคือไม่ใช่เฉพาะกับ“ เพื่อน” ของผู้ใช้) ผู้ใช้ที่โพสต์เนื้อหาที่ส่งดังกล่าวจะถือว่าได้ให้สิทธิ์ GOOChat ทั่วโลกตลอดไป สิทธิ์การใช้งานแบบปลอดค่าลิขสิทธิ์ (รวมถึงสิทธิ์ในการแก้ไข (เช่นการย่อ) เนื้อหาดังกล่าวตามที่ GOOChat เห็นว่าจำเป็นและเหมาะสมและสิทธิ์ในการอนุญาตช่วงต่อสิทธิ์การใช้งานดังกล่าวให้กับบุคคลที่สามอื่น ๆ ที่ทำงานร่วมกับ GOOChat) เพื่อใช้เนื้อหาดังกล่าวสำหรับ บริการและ / หรือวัตถุประสงค์ในการส่งเสริมการขาย 
                    <br/>8.7 ผู้ใช้จะไม่ใช้สิทธิ์ของตนเช่นสิทธิ์ทางศีลธรรมของผู้เขียนในส่วนที่เกี่ยวกับเนื้อหาที่ส่งมาซึ่งเกี่ยวข้องกับการใช้งานโดย GOOChat หรือบุคคลที่สามภายใต้ข้อ 8.5 และ 8.6 ข้างต้น 
                    <br/>8.8 GOOChat อาจตรวจสอบและยืนยันเนื้อหาของเนื้อหาที่ส่งโดยผู้ใช้ตามขอบเขตที่อนุญาตภายใต้กฎหมายและข้อบังคับเมื่อจำเป็นที่ GOOChat จะต้องยืนยันการปฏิบัติตามกฎหมายและข้อบังคับที่เกี่ยวข้องหรือข้อกำหนดที่กำหนดไว้ในข้อกำหนดและเงื่อนไขเหล่านี้เป็นต้น .; อย่างไรก็ตาม GOOChat ไม่จำเป็นต้องดำเนินการยืนยันดังกล่าว 
                    <br/>8.9 หาก GOOChat เชื่อว่าผู้ใช้ละเมิดหรืออาจละเมิดกฎหมายหรือข้อบังคับที่เกี่ยวข้องหรือข้อกำหนดของข้อกำหนดและเงื่อนไขเหล่านี้ที่เกี่ยวข้องกับเนื้อหาที่ส่งมาหรือเมื่อจำเป็นอย่างอื่นตามสมควรสำหรับธุรกิจของ GOOChat GOOChat ขอสงวนสิทธิ์ในการละเว้นสิ่งนั้น การใช้บริการของผู้ใช้ในลักษณะบางอย่างเช่นการลบเนื้อหาที่ส่งโดยไม่แจ้งให้ผู้ใช้ทราบล่วงหน้า</p>

                <Title>9. การให้บริการสมัครสมาชิก</Title>

                <p>9.1 ผู้ใช้อาจได้รับบริการเพื่อแลกกับการชำระค่าธรรมเนียมหรือภายใต้ข้อกำหนดและเงื่อนไขที่ GOOChat กำหนดโดยผู้ใช้จ่ายค่าพิจารณาจำนวนหนึ่งเพื่อใช้เนื้อหาหัวเรื่องบางอย่างที่ GOOChat กำหนดในช่วงเวลาหนึ่ง ("การสมัครสมาชิก บริการ”) ผู้ใช้จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขเหล่านี้ค่าธรรมเนียมสำหรับบริการสมัครสมาชิกวิธีการชำระเงินตลอดจนข้อกำหนดและเงื่อนไขการใช้งานอื่น ๆ ที่โพสต์บนบริการหรือบนเว็บไซต์ของ GOOChat 
                <br/>9.2 ผู้ใช้สามารถดำเนินการยกเลิกบริการสมัครสมาชิกได้ตลอดเวลา อย่างไรก็ตามแม้ว่าผู้ใช้จะดำเนินการตามขั้นตอนการยกเลิกก่อนระยะเวลาการใช้งานที่กำหนดไว้ผู้ใช้ไม่สามารถเปลี่ยนระยะเวลาการใช้งานดังกล่าวและผู้ใช้ไม่สามารถยกเลิกการซื้อบริการสมัครสมาชิกได้ ในกรณีนี้ค่าธรรมเนียมที่ชำระไปแล้วจะไม่ได้รับการคืนเงินและจะไม่มีการคืนเงินใด ๆ ตามสัดส่วน อย่างไรก็ตามสิ่งที่กล่าวมาจะใช้ไม่ได้หากกฎหมายหรือข้อบังคับกำหนดไว้เป็นอย่างอื่น 
                <br/>9.3 หากผู้ใช้ไม่ดำเนินการยกเลิกตามวันและเวลาที่กำหนดระยะเวลาการใช้บริการสมัครสมาชิกอาจต่ออายุโดยอัตโนมัติตามเงื่อนไขที่ GOOChat กำหนดแม้ว่าจะสิ้นสุดระยะเวลาการใช้งานการสมัครสมาชิกดังกล่าวแล้วก็ตาม บริการ.</p>

                <Title>10. เรื่องที่ถูก จำกัด</Title>

                <p>GOOChat ห้ามไม่ให้ผู้ใช้มีส่วนร่วมในการกระทำใด ๆ ต่อไปนี้เมื่อใช้บริการ: 
                    <br/>10.1 การกระทำที่ละเมิดกฎหมายและข้อบังคับคำตัดสินของศาลมติหรือคำสั่งหรือมาตรการทางการบริหารที่มีผลผูกพันทางกฎหมาย 
                    <br/>10.2 การกระทำที่อาจละเมิดความสงบเรียบร้อยศีลธรรมหรือประเพณีของประชาชน 
                    <br/>10.3 การกระทำที่ละเมิดสิทธิ์ในทรัพย์สินทางปัญญาเช่นลิขสิทธิ์เครื่องหมายการค้าและสิทธิ์ในสิทธิบัตรสิทธิ์ในชื่อเสียงความเป็นส่วนตัวและสิทธิ์อื่น ๆ ทั้งหมดที่ได้รับตามกฎหมายหรือโดยสัญญากับ GOOChat และ / หรือบุคคลที่สาม 
                    <br/>10.4 การโพสต์หรือส่งการแสดงออกทางเพศที่รุนแรงหรือโจ่งแจ้งเกินไป การแสดงออกที่สื่อถึงภาพอนาจารของเด็กหรือการล่วงละเมิดเด็ก การแสดงออกที่นำไปสู่การเลือกปฏิบัติตามเชื้อชาติชาติกำเนิดความเชื่อเพศสถานะทางสังคมที่มาของครอบครัว ฯลฯ ; การแสดงออกที่กระตุ้นหรือสนับสนุนให้ฆ่าตัวตายพฤติกรรมทำร้ายตัวเองหรือการใช้ยาในทางที่ผิด หรือการแสดงออกที่มีเนื้อหาต่อต้านสังคมและนำไปสู่ความไม่สบายใจของผู้อื่น 
                    <br/>10.5 การกระทำที่นำไปสู่การบิดเบือนความจริงของ GOOChat และ / หรือบุคคลที่สามหรือจงใจเผยแพร่ข้อมูลเท็จ 
                    <br/>10.6 การส่งข้อความที่เหมือนกันหรือคล้ายกันไปยังผู้ใช้จำนวนมากโดยไม่มีกำหนด (ยกเว้นที่ GOOChat อนุมัติ) การเพิ่มผู้ใช้รายอื่นเป็นเพื่อนหรือการแชทเป็นกลุ่มโดยไม่เลือกปฏิบัติหรือการกระทำอื่นใดที่ GOOChat ถือว่าเป็นการส่งสแปม 
                    <br/>10.7 การแลกเปลี่ยนสิทธิในการใช้บริการหรือเนื้อหาเป็นเงินสดทรัพย์สินหรือผลประโยชน์ทางเศรษฐกิจอื่น ๆ นอกเหนือจากการใช้วิธีการที่ GOOChat กำหนด 
                    <br/>10.8 การใช้บริการเพื่อการขายการตลาดการโฆษณาการชักชวนหรือวัตถุประสงค์ทางการค้าอื่น ๆ (ยกเว้นที่ GOOChat อนุมัติ) การใช้บริการเพื่อวัตถุประสงค์ในการประพฤติทางเพศหรือการกระทำอนาจาร การใช้บริการเพื่อจุดประสงค์ในการพบปะหรือมีส่วนร่วมในการเผชิญหน้าทางเพศกับบุคคลที่สามที่ไม่รู้จัก การใช้บริการเพื่อวัตถุประสงค์ในการคุกคามหรือโจมตีผู้ใช้รายอื่นในเชิงหมิ่นประมาท หรือการใช้บริการเพื่อวัตถุประสงค์อื่นนอกเหนือจากที่ตั้งใจไว้โดยบริการ 
                    <br/>10.9 การกระทำที่เอื้อประโยชน์หรือเกี่ยวข้องกับความร่วมมือกับกลุ่มต่อต้านสังคม 
                    <br/>10.10 การกระทำที่เกี่ยวข้องกับกิจกรรมทางศาสนาหรือการเชิญชวนให้กลุ่มศาสนาบางกลุ่ม 
                    <br/>10.11 การรวบรวมเปิดเผยหรือจัดเตรียมข้อมูลส่วนบุคคลของบุคคลอื่นข้อมูลที่ลงทะเบียนประวัติผู้ใช้หรือสิ่งที่คล้ายกันโดยไม่ได้รับอนุญาตหรือไม่เหมาะสม 
                    <br/>10.12 การกระทำที่รบกวนเซิร์ฟเวอร์และ / หรือระบบเครือข่ายของบริการ หลอกลวงจัดการบริการโดยใช้บอทเครื่องมือโกงหรือมาตรการทางเทคนิคอื่น ๆ จงใจใช้ข้อบกพร่องของบริการ การสอบถามที่ไม่มีเหตุผลและ / หรือการอ้างสิทธิ์ที่ไม่เหมาะสมเช่นการถามคำถามเดิมซ้ำ ๆ เกินความจำเป็นและการกระทำอื่นใดที่ขัดขวางหรือขัดขวางการทำงานของบริการของ GOOChat หรือการใช้บริการของผู้ใช้รายอื่น 
                    <br/>10.13 การกระทำในการถอดรหัสซอร์สโค้ดของบริการเช่นการทำวิศวกรรมย้อนกลับการแยกชิ้นส่วนหรือสิ่งที่คล้ายกันเพื่อวัตถุประสงค์ที่ไม่สมเหตุสมผลหรือในลักษณะที่ไม่เป็นธรรม 
                    <br/>10.14 การกระทำที่ช่วยเหลือหรือสนับสนุนการกระทำใด ๆ ที่ระบุไว้ในข้อ 10.1 ถึง 10.13 ข้างต้น และ 
                    <br/>10.15 การกระทำนอกเหนือจากที่ระบุไว้ในข้อ 10.1 ถึง 10.14 ที่ GOOChat เห็นว่าไม่เหมาะสมอย่างสมเหตุสมผล</p>

                <Title>11. ความรับผิดชอบของผู้ใช้</Title>

                <p>11.1 ผู้ใช้จะต้องใช้บริการด้วยความเสี่ยงของตนเองและจะต้องรับผิดชอบใด ๆ และทั้งหมดสำหรับการดำเนินการภายใต้และผลจากการใช้บริการ 
                <br/>11.2 GOOChat อาจระงับการใช้บริการทั้งหมดหรือบางส่วนระงับหรือลบบัญชียกเลิกข้อตกลงใด ๆ ระหว่างผู้ใช้และ GOOChat ที่เกี่ยวข้องกับบริการ (รวมถึง แต่ไม่ จำกัด เพียงข้อตกลงใด ๆ ตามข้อกำหนดและเงื่อนไขเหล่านี้ต่อจากนี้ไป เดียวกัน) หรือใช้มาตรการอื่นใดที่ GOOChat พิจารณาอย่างสมเหตุสมผลว่าจำเป็นและเหมาะสมโดยไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้าในกรณีที่ผู้ใช้ดังกล่าวตกอยู่ภายใต้หรือมีความเป็นไปได้ที่ผู้ใช้ดังกล่าวตกอยู่ภายใต้รายการใดรายการหนึ่งดังต่อไปนี้: 
                <br/>(1) ผู้ใช้ เป็นการละเมิดกฎหมายและข้อบังคับที่เกี่ยวข้องข้อกำหนดและเงื่อนไขเหล่านี้หรือข้อกำหนดและเงื่อนไขแยกต่างหาก 
                <br/>(2) ผู้ใช้เป็นสมาชิกของกลุ่มต่อต้านสังคมหรือบุคคลที่เกี่ยวข้อง 
                <br/>(3) ผู้ใช้ทำให้ความน่าเชื่อถือของ GOOChat เสื่อมเสียโดยการเผยแพร่ข้อมูลที่เป็นเท็จโดยใช้วิธีการหลอกลวงหรือการบังคับหรือวิธีการอื่น ๆ ที่ผิดกฎหมาย 
                <br/>(4) ผู้ใช้ต้องถูกยื่นคำร้องสำหรับการแนบไฟล์แนบชั่วคราวหรือการประมูล; ขั้นตอนต่างๆเช่นการล้มละลายการฟื้นฟูสมรรถภาพทางแพ่งหรือขั้นตอนที่คล้ายคลึงกันจะเริ่มขึ้น หรือ GOOChat พิจารณาอย่างสมเหตุสมผลว่ามีความไม่แน่นอนเกี่ยวกับความน่าเชื่อถือของผู้ใช้ หรือ 
                <br/>(5) ความสัมพันธ์ของความไว้วางใจกับผู้ใช้หายไปหรือ GOOChat พิจารณาอย่างมีเหตุผลว่าไม่เหมาะสมที่ GOOChat จะให้บริการแก่ผู้ใช้เนื่องจากเหตุผลอื่นนอกเหนือจากที่ระบุไว้ในข้อ (1) ถึง (4) ข้างบน. 
                <br/>11.3 ในกรณีที่ GOOChat ประสบความสูญเสีย / ความเสียหายไม่ว่าโดยตรงหรือโดยอ้อม (รวมถึง แต่ไม่ จำกัด เพียงค่าทนายความ) อันเนื่องมาจากการใช้บริการของผู้ใช้ (รวมถึง แต่ไม่ จำกัด เพียงกรณีที่ GOOChat ได้รับการร้องเรียนจากบุคคลที่สามเนื่องจาก การใช้งานดังกล่าว) ผู้ใช้จะต้องชดใช้ให้ GOOChat ทันทีสำหรับความสูญเสีย / ความเสียหายดังกล่าวตามคำขอของ GOOChat </p>
                
                <Title>12. ไม่มีการรับประกัน</Title>

                <p>GOOChat การรับประกันจะไม่ให้การรับประกันไม่ว่าจะโดยชัดแจ้งหรือโดยนัยด้วยความเคารพต่อบริการ (รวมถึงเนื้อหาย่อย) ซึ่งไม่มีข้อบกพร่องใด ๆ (รวมถึงโดยไม่มีข้อ จำกัด ความผิดพลาดเกี่ยวกับข้อผิดพลาดหรือความปลอดภัย ฯลฯ ) , หรือการละเมิดสิทธิ์) หรือด้านความปลอดภัย, ความน่าเชื่อถือ, ความถูกต้อง, ความสมบูรณ์, ประสิทธิภาพและความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ GOOChat จะไม่มีทางรับผิดชอบต่อการให้บริการแก่ผู้ใช้หลังจากการลบข้อบกพร่องดังกล่าว</p>

                <Title>13. ข้อจำกัดความรับผิดของ GOOChat</Title>

                <p>13.1 GOOChat จะไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้นจากผู้ใช้จากการใช้บริการทั้งนี้ความเสียหายดังกล่าวไม่สามารถเกิดขึ้นได้จากการกระทำที่ไม่เหมาะสมโดยเจตนาหรือโดยทั่วไป ให้ไว้อย่างไรก็ตามในกรณีที่ข้อตกลงระหว่างผู้ใช้และบรรทัดที่เกี่ยวข้องกับการใช้บริการนั้นตกอยู่ภายใต้สัญญาของผู้บริโภคตามที่กำหนดไว้ภายใต้พระราชบัญญัติสัญญาผู้บริโภค ("สัญญาผู้บริโภค") GOOChat จะอยู่ภายใต้สัญญาผู้บริโภค เพื่อให้การชดเชยสำหรับความเสียหายที่เกิดขึ้นเนื่องจากความประมาทเลินเล่อในส่วนของบรรทัด (ไม่รวมถึงความประมาทเลินเล่อ) ที่เกิดจากสัญญาหรือการละเมิดเท่านั้นภายในช่วงของ (A) ความเสียหายที่เกิดขึ้นโดยปกติ (เช่นยกเว้นการสูญเสียผลกำไรและความเสียหายอื่น ๆ วงจรพิเศษ) 
                <br/>13.2 หากผู้ใช้ได้รับความเสียหายอันเนื่องมาจากความประมาทเลินเล่อในส่วนของไลน์ GOOChat จะรับผิดชอบในการให้ค่าตอบแทนสำหรับความเสียหายที่เกิดขึ้น แต่เฉพาะภายในช่วง (A) ความเสียหายที่เกิดขึ้นโดยปกติ (IE ยกเว้นเฉพาะในช่วง (A) เท่านั้น การสูญเสียผลกำไรและความเสียหายอื่น ๆ ที่เกิดขึ้นภายใต้สถานการณ์พิเศษ) และ (B) จำนวนค่าธรรมเนียมการใช้งานสำหรับบริการที่ได้รับจากผู้ใช้ดังกล่าวสำหรับบริการที่เรียกเก็บค่าธรรมเนียมสำหรับเดือนซึ่งความเสียหายดังกล่าวจะเกิดขึ้นสูงสุด; ให้ไว้อย่างไรก็ตามการบังคับใช้จะไม่ใช้บังคับหากข้อตกลงระหว่างผู้ใช้ดังกล่าวและไลน์ล้มเหลวภายใต้การกำหนดของสัญญาผู้บริโภค</p>

                <Title>14. ความสัมพันธ์ระหว่างข้อกำหนดและเงื่อนไขและกฎหมายและข้อบังคับเหล่านี้</Title>

                <p>หากข้อกำหนดของข้อกำหนดและเงื่อนไขเหล่านี้ละเมิดกฎหมายและข้อบังคับใด ๆ ที่บังคับใช้กับข้อตกลงระหว่างผู้ใช้และ GOOChat ที่เกี่ยวข้องกับบริการ (รวมถึง แต่ไม่ จำกัด เพียงพระราชบัญญัติสัญญาผู้บริโภค) ข้อกำหนดดังกล่าวในขอบเขตของการละเมิดดังกล่าว จะไม่นำไปใช้กับข้อตกลงกับผู้ใช้ อย่างไรก็ตามเงื่อนไขที่เหลือของข้อกำหนดและเงื่อนไขเหล่านี้จะไม่ได้รับผลกระทบ</p>

                <Title>15. การแจ้งเตือนและการติดต่อ</Title>

                <p>15.1 สำหรับการแจ้งเตือนจาก GOOChat ถึงผู้ใช้เกี่ยวกับบริการ GOOChat จะใช้วิธีการที่ GOOChat เห็นว่าเหมาะสมเช่นการโพสต์ในสถานที่ที่เหมาะสมภายในบริการหรือบนเว็บไซต์ของ GOOChat 
                    <br/>15.2 สำหรับการแจ้งเตือนจากผู้ใช้ถึง GOOChat เกี่ยวกับบริการผู้ใช้จะต้องใช้แบบฟอร์มสอบถามลูกค้าที่มีอยู่ในบริการหรือบนเว็บไซต์ของ GOOChat หรือด้วยวิธีการอื่นที่ GOOChat กำหนด</p>
            </Body>
        </Container>
    )
}
export default Termth;